package controllers

import "github.com/gin-gonic/gin"

// 响应格式
type responseFormat struct {
	Code int    `json:"code"`
	Msg  string `json:"msg"`
	Data string `json:"data"`
}

type Controller struct {
}

/**
 * 失败响应
 */
func (c *Controller) BadResponse(code int, data string, context *gin.Context) {
	format := responseFormat{
		Code: 10000,
		Msg:  badCode[10000],
		Data: data,
	}

	if badMsg, exist := badCode[code]; exist {
		format.Code = code
		format.Msg = badMsg
	}

	context.JSON(200, format)
}

/**
 * 错误码
 */
var badCode = map[int]string{
	10000: "参数错误",
	10001: "地区不能为空",

	/***** 产品中心/VIP操盘start ******/
	20001: "同步产品到呼叫系统/客服系统失败",
	20002: "区域配置不存在",
	20003: "同步审核状态失败",
	20004: "同步合规审核失败",
	20005: "产品不存在",
	20006: "获取订单from转换json数据失败",
	20007: "同步订单信息到客服系统失败",
	20008: "同步vip操盘产品到呼叫系统/客服系统失败",
	20009: "客服人员信息不存在",
	20010: "同步客服信息到客服系统失败",
	20011: "拉取客服系统的产品上级和投顾直属上级失败",
	20012: "同步客服时客服系统返回空ID",
	20013: "同步订单信息的部分数据失败",
	20014: "同步用户客服关系到呼叫系统成功，客服系统失败",
	20015: "同步用户客服关系到呼叫系统失败，客服系统成功",
	20016: "同步用户客服关系到呼叫系统失败，客服系统失败",
	20017: "通过用户ID，获取订单列表失败",
	20018: "拨打电话失败",
	20030: "获取呼叫系统订单列表失败",
	20031: "获取呼叫系统订单文件列表失败",
	20032: "获取呼叫系统订单数据失败",
	20100: "系统打通触发客服系统分配客服时失败",
	20101: "产品中心调用crm获取需要补充的字段失败",
	/***** 产品中心/VIP操盘end ******/

	20200: "根据用户ID 获取用户信息系统成功，呼叫系统失败",
	20201: "根据用户ID 获取用户信息系统失败，from转换json数据失败",
	20202: "根据用户ID 获取用户信息系统失败，获取配置文件对应的tcp地址失败",
	20203: "根据用户ID 获取用户信息系统失败，通信对象不存在",

	20300: "根据用户ID 置空用户编号系统成功，呼叫系统失败",
	20301: "根据用户ID 置空用户编号系统失败，from转换json数据失败",
	20302: "根据用户ID 置空用户编号系统失败，获取配置文件对应的tcp地址失败",
	20303: "根据用户ID 置空用户编号系统失败，通信对象不存在",

	20401: "通过区域、CRM线下用户id、产品中心产品id获取对应客服系统对应客服id失败",
}
